#include <iostream>
#include <iomanip> // Для використання шістнадцяткового виводу

// Функція для обчислення значення ѕ
int s_calculation(int x, int y, int z) {
    return (x * y) + z;
}

int main() {
    // Змінні для зберігання значень x, y, та z
    int x, y, z;

    // Запит користувача на введення значень
    std::cout << "Введіть значення x: ";
    std::cin >> x;

    std::cout << "Введіть значення y: ";
    std::cin >> y;

    std::cout << "Введіть значення z: ";
    std::cin >> z;

    // Обчислення значення ѕ
    int ѕ = s_calculation(x, y, z);

    // Виведення результатів
    std::cout << "Значення х у десятковій системі числення: " << x << std::endl;
    std::cout << "Значення у у десятковій системі числення: " << y << std::endl;
    std::cout << "Значення z у десятковій системі числення: " << z << std::endl;
    std::cout << "Значення ѕ у десятковій системі числення: " << ѕ << std::endl;

    // Виведення результатів у шістнадцятковій системі числення
    std::cout << "Значення ѕ у шістнадцятковій системі числення: 0x" << std::hex << ѕ << std::endl;

    std::cout << "Чернолєс Кирило (С)" << std::endl;

    return 0;
}
