#include <iostream>
#include <iomanip> // Для використання шістнадцяткового виводу
#include <cmath>


//8.2.3
// Функція для обчислення значення ѕ
int s_calculation(int x, int y, int z) {
    return (x * y) + z;
}

int Task8_2_3() {
    // Змінні для зберігання значень x, y, та z
    int x, y, z;

    // Запит користувача на введення значень
    std::cout << "Введіть значення x: ";
    std::cin >> x;

    std::cout << "Введіть значення y: ";
    std::cin >> y;

    std::cout << "Введіть значення z: ";
    std::cin >> z;

    // Обчислення значення ѕ
    int ѕ = s_calculation(x, y, z);

    // Виведення результатів
    std::cout << "Значення х у десятковій системі числення: " << x << std::endl;
    std::cout << "Значення у у десятковій системі числення: " << y << std::endl;
    std::cout << "Значення z у десятковій системі числення: " << z << std::endl;
    std::cout << "Значення ѕ у десятковій системі числення: " << ѕ << std::endl;

    // Виведення результатів у шістнадцятковій системі числення
    std::cout << "Значення ѕ у шістнадцятковій системі числення: 0x" << std::hex << ѕ << std::endl;

    std::cout << "Чернолєс Кирило (c) | Академ-група:КБ-23 | ЦНТУ" << std::endl;

    return 0;
}


//8.2.2
int Task8_2_2() {
    double a, b;
    
// Введення значень a та b
    std::cout << "Введите значение a: ";
    std::cin >> a;
    std::cout << "Введите значение b: ";
    std::cin >> b;


// Обчислення модуля різниці | b-5 |
    double mod_b_minus_5 = std::abs(b - 5);

// Перевірка умови нерівності та виведення результату
    if (a + 7 < mod_b_minus_5) {
        std::cout << "1" << std::endl;
    } else {
        std::cout << "0" << std::endl;
    }
    
    std::cout << "Чернолєс Кирило (c) | Академ-група:КБ-23 | ЦНТУ" << std::endl;

    
    return 0;
}

//8.2.1
int main(){
    std::cout << "Чернолєс Кирило (c) | Академ-група:КБ-23 | ЦНТУ" << std::endl;

    return 0;
}